app/controllers/songs_controller.rb

  def index
    if @song.valid?
       @songs = Song.all
---
SELECT "songs".* FROM "songs"